# Dataset_01

In [2]:
import pandas as pd
df = pd.read_csv('Dataset_01.csv')
df.head(2)

     TV     Radio  Social_Media Influencer      Sales
0  16.0  6.566231      2.907983       Mega  54.732757
1  13.0  9.237765      2.409567       Mega  46.677897

In [3]:
df.isna().sum().sum()

26

### 1) 26

In [6]:
df_sub = df.loc[:, ['TV', 'Radio', 'Social_Media', 'Sales']]
df_sub.head(2)

     TV     Radio  Social_Media      Sales
0  16.0  6.566231      2.907983  54.732757
1  13.0  9.237765      2.409567  46.677897

In [7]:
df_sub.corr().round(4)

                  TV   Radio  Social_Media   Sales
TV            1.0000  0.8695        0.5282  0.9995
Radio         0.8695  1.0000        0.6075  0.8691
Social_Media  0.5282  0.6075        1.0000  0.5289
Sales         0.9995  0.8691        0.5289  1.0000

### 2) 0.9995

In [9]:
df_sub2 = df.dropna()
df_sub2.head(2)

     TV     Radio  Social_Media Influencer      Sales
0  16.0  6.566231      2.907983       Mega  54.732757
1  13.0  9.237765      2.409567       Mega  46.677897

In [10]:
df_sub2.isna().sum()

TV              0
Radio           0
Social_Media    0
Influencer      0
Sales           0
dtype: int64

In [11]:
from sklearn.linear_model import LinearRegression

In [12]:
model = LinearRegression().fit(X = df_sub2.iloc[:, :3],
                              y = df_sub2["Sales"])
model

LinearRegression()

In [13]:
model.coef_.round(4)

array([ 3.5626, -0.004 ,  0.005 ])

### 3) 3.562

# Dataset_02

In [14]:
df = pd.read_csv('Dataset_02.csv')
df.head(2)

   Age Sex    BP Cholesterol  Na_to_K   Drug
0   23   F  HIGH        HIGH   25.355  DrugY
1   47   M   LOW        HIGH   13.093  drugC

In [15]:
df.isna().sum()

Age            0
Sex            0
BP             0
Cholesterol    0
Na_to_K        0
Drug           0
dtype: int64

In [16]:
df_sub = df.loc[(df["Sex"] == 'F') & 
       (df["BP"] == 'HIGH') & 
       (df['Cholesterol'] == "NORMAL"), :]
len(df_sub)

21

In [17]:
len(df_sub) / len(df)

0.105

### 1) 0.105

In [18]:
df = pd.read_csv('Dataset_02.csv')

In [19]:
import numpy as np
df['Age_gr'] = np.where(df['Age'] < 20, 10,
                       np.where(df['Age'] < 30, 20,
                               np.where(df['Age'] < 40, 30,
                                       np.where(df['Age'] < 50, 40,
                                               np.where(df['Age'] < 60, 50, 60)))))
df.head(2)

   Age Sex    BP Cholesterol  Na_to_K   Drug  Age_gr
0   23   F  HIGH        HIGH   25.355  DrugY      20
1   47   M   LOW        HIGH   13.093  drugC      40

In [20]:
df['Age_gr'].unique()

array([20, 40, 60, 30, 50, 10])

In [21]:
df['Na_K_gr'] = np.where(df['Na_to_K'] <= 10, 'Lv1',
                        np.where(df['Na_to_K'] <= 20, 'Lv2',
                                np.where(df['Na_to_K'] <= 30, 'Lv3', 'Lv4')))
df.head(2)

   Age Sex    BP Cholesterol  Na_to_K   Drug  Age_gr Na_K_gr
0   23   F  HIGH        HIGH   25.355  DrugY      20     Lv3
1   47   M   LOW        HIGH   13.093  drugC      40     Lv2

In [22]:
df['Na_K_gr'].unique()

array(['Lv3', 'Lv2', 'Lv1', 'Lv4'], dtype=object)

In [23]:
from scipy.stats import chi2_contingency

In [24]:
stat, p, dof, e_val = chi2_contingency(pd.crosstab(index = df['Sex'], columns = df['Drug']))
round(p, 5)

0.71384

In [25]:
stat, p, dof, e_val = chi2_contingency(pd.crosstab(df['BP'], df['Drug']))
round(p, 5)

0.0

In [26]:
stat, p, dof, e_val = chi2_contingency(pd.crosstab(df['Cholesterol'], df['Drug']))
round(p, 5)

0.0006

In [27]:
stat, p, dof, e_val = chi2_contingency(pd.crosstab(df['Age_gr'], df['Drug']))
round(p, 5)

0.0007

In [28]:
stat, p, dof, e_val = chi2_contingency(pd.crosstab(df['Na_K_gr'], df['Drug']))
round(p, 5)

0.0

### 2) 0.0007

In [110]:
df = pd.read_csv('Dataset_02.csv')
df.head(2)

   Age Sex    BP Cholesterol  Na_to_K   Drug
0   23   F  HIGH        HIGH   25.355  DrugY
1   47   M   LOW        HIGH   13.093  drugC

In [111]:
df['Sex_cd'] = np.where(df['Sex'] == "M", 0, 1)
df.head(2)

   Age Sex    BP Cholesterol  Na_to_K   Drug  Sex_cd
0   23   F  HIGH        HIGH   25.355  DrugY       1
1   47   M   LOW        HIGH   13.093  drugC       0

In [112]:
df['BP_cd'] = np.where(df['BP'] == 'LOW', 0,
                      np.where(df['BP'] == 'NORMAL', 1, 2))
df.head(2)

   Age Sex    BP Cholesterol  Na_to_K   Drug  Sex_cd  BP_cd
0   23   F  HIGH        HIGH   25.355  DrugY       1      2
1   47   M   LOW        HIGH   13.093  drugC       0      0

In [113]:
df['Ch_cd'] = np.where(df['Cholesterol'] == 'NORMAL', 0, 1)
df.head(2)

   Age Sex    BP Cholesterol  Na_to_K   Drug  Sex_cd  BP_cd  Ch_cd
0   23   F  HIGH        HIGH   25.355  DrugY       1      2      1
1   47   M   LOW        HIGH   13.093  drugC       0      0      1

In [116]:
from sklearn.tree import DecisionTreeClassifier, export_text
model_c = DecisionTreeClassifier().fit(X = df.loc[:, ['Age', 'Na_to_K', 'Sex_cd', 'BP_cd', 'Ch_cd']],
                                      y = df['Drug'])
model_c

DecisionTreeClassifier()

In [121]:
export_text(model_c, feature_names = ['Age', 'Na_to_K', 'Sex_cd', 'BP_cd', 'Ch_cd'])

'|--- Na_to_K <= 14.83\n|   |--- BP_cd <= 1.50\n|   |   |--- BP_cd <= 0.50\n|   |   |   |--- Ch_cd <= 0.50\n|   |   |   |   |--- class: drugX\n|   |   |   |--- Ch_cd >  0.50\n|   |   |   |   |--- class: drugC\n|   |   |--- BP_cd >  0.50\n|   |   |   |--- class: drugX\n|   |--- BP_cd >  1.50\n|   |   |--- Age <= 50.50\n|   |   |   |--- class: drugA\n|   |   |--- Age >  50.50\n|   |   |   |--- class: drugB\n|--- Na_to_K >  14.83\n|   |--- class: DrugY\n'

### 3) 14.83

# Dataset 03

In [122]:
df = pd.read_csv('Dataset_03.csv')
df.head(2)

,long_hair,forehead_width_cm,forehead_height_cm,nose_wide,nose_long,lips_thin,distance_nose_to_lip_long,gender
0,1,11.8,6.1,1,0,1,1,Male
1,0,14.0,5.4,0,0,1,0,Female

In [123]:
df['ratio'] = df['forehead_width_cm'] / df['forehead_height_cm']
df.head(2)

,long_hair,forehead_width_cm,forehead_height_cm,nose_wide,nose_long,lips_thin,distance_nose_to_lip_long,gender,ratio
0,1,11.8,6.1,1,0,1,1,Male,1.934426
1,0,14.0,5.4,0,0,1,0,Female,2.592593

In [125]:
ratio_mean = df['ratio'].mean()
ratio_mean

2.233618718921451

In [127]:
ration_std = df['ratio'].std()
ration_std

0.2645252969973522

In [129]:
(df['ratio'] < ratio_mean - 3 * ration_std).sum()

0

In [130]:
(df['ratio'] > ratio_mean + 3 * ration_std).sum()

3

### 1) 3

In [132]:
df.head(2)

,long_hair,forehead_width_cm,forehead_height_cm,nose_wide,nose_long,lips_thin,distance_nose_to_lip_long,gender,ratio
0,1,11.8,6.1,1,0,1,1,Male,1.934426
1,0,14.0,5.4,0,0,1,0,Female,2.592593

In [131]:
from scipy.stats import ttest_ind

In [133]:
df_M = df[df['gender'] == 'Male']
df_F = df[df['gender'] == 'Female']

In [138]:
stat, p = ttest_ind(df_M['ratio'], df_F['ratio'], equal_var = False)
round(p, 3)

0.003

In [139]:
round(stat, 3)

2.999

### 2) 2.999

In [357]:
df = pd.read_csv('Dataset_03.csv')
df.head(2)

,long_hair,forehead_width_cm,forehead_height_cm,nose_wide,nose_long,lips_thin,distance_nose_to_lip_long,gender
0,1,11.8,6.1,1,0,1,1,Male
1,0,14.0,5.4,0,0,1,0,Female

In [358]:
from sklearn.model_selection import train_test_split

In [359]:
df_train, df_test = train_test_split(df, train_size = 0.7, random_state = 123)

In [360]:
df_train.head(2)

,long_hair,forehead_width_cm,forehead_height_cm,nose_wide,nose_long,lips_thin,distance_nose_to_lip_long,gender
3991,1,12.5,6.9,1,1,1,0,Male
4163,1,12.4,5.3,1,1,1,1,Male

In [361]:
df_test.head(2)

,long_hair,forehead_width_cm,forehead_height_cm,nose_wide,nose_long,lips_thin,distance_nose_to_lip_long,gender
2648,0,11.7,6.8,1,1,0,1,Male
2456,1,14.6,7.0,1,1,1,1,Male

In [362]:
from sklearn.linear_model import LogisticRegression

In [363]:
model = LogisticRegression().fit(X = df_train.iloc[:, :-1],
                                y = df_train['gender'])
model

LogisticRegression()

In [364]:
pred = model.predict(df_test.iloc[:, :-1])
df_test['pred'] = pred
df_test.head(2)

,long_hair,forehead_width_cm,forehead_height_cm,nose_wide,nose_long,lips_thin,distance_nose_to_lip_long,gender,pred
2648,0,11.7,6.8,1,1,0,1,Male,Male
2456,1,14.6,7.0,1,1,1,1,Male,Male

In [365]:
from sklearn.metrics import precision_score

In [367]:
precision_score(y_true = df_test['gender'], y_pred = df_test['pred'], pos_label = 'Male')

0.9596354166666666

# Dataset 04

In [29]:
df = pd.read_csv('Dataset_04.csv')
df.head(2)

  LOCATION SUBJECT  TIME      Value
0      AUS    BEEF  1991  27.721815
1      AUS    BEEF  1992  26.199591

In [30]:
df_kor = df[df['LOCATION'] == 'KOR']
df_kor.head()

    LOCATION SUBJECT  TIME     Value
442      KOR    BEEF  1991  5.085481
443      KOR    BEEF  1992  5.685434
444      KOR    BEEF  1993  5.325765
445      KOR    BEEF  1994  5.698819
446      KOR    BEEF  1995  6.568429

In [31]:
df_kor['LOCATION'].unique()

array(['KOR'], dtype=object)

In [32]:
df_kor['SUBJECT'].unique()

array(['BEEF', 'PIG', 'POULTRY', 'SHEEP'], dtype=object)

In [33]:
df_kor_T = df_kor.groupby('TIME')[['Value']].sum().reset_index()
df_kor_T.head(2)

   TIME      Value
0  1990   5.774255
1  1991  21.911207

In [34]:
df_kor_T.corr().round(2)

       TIME  Value
TIME   1.00   0.96
Value  0.96   1.00

### 1) 0.96

In [74]:
df = pd.read_csv('Dataset_04.csv')
df.head(2)

  LOCATION SUBJECT  TIME      Value
0      AUS    BEEF  1991  27.721815
1      AUS    BEEF  1992  26.199591

In [75]:
df_sub = df[df['LOCATION'].isin(['KOR', 'JPN'])]
df_sub.head(2)

    LOCATION SUBJECT  TIME     Value
294      JPN    BEEF  1990  6.111035
295      JPN    BEEF  1991  6.517055

In [76]:
df_sub['LOCATION'].unique()

array(['JPN', 'KOR'], dtype=object)

In [77]:
df_sub = df_sub.dropna()
df_sub.head(2)

    LOCATION SUBJECT  TIME     Value
294      JPN    BEEF  1990  6.111035
295      JPN    BEEF  1991  6.517055

In [78]:
df_sub = pd.pivot(data = df_sub, index = ['SUBJECT', 'TIME'], columns = 'LOCATION', values = 'Value').reset_index()
df_sub = df_sub.dropna()

In [79]:
from scipy.stats import ttest_rel

In [82]:
stat, p = ttest_rel(df_sub['KOR'], df_sub['JPN'])

In [84]:
round(stat, 3)

5.663

### 2) 5.663

In [96]:
df = pd.read_csv('Dataset_04.csv')
df.head(2)

  LOCATION SUBJECT  TIME      Value
0      AUS    BEEF  1991  27.721815
1      AUS    BEEF  1992  26.199591

In [97]:
df_sub = df[df['LOCATION'] == 'KOR']
df_sub['LOCATION'].unique()

array(['KOR'], dtype=object)

In [98]:
df_sub.head(2)

    LOCATION SUBJECT  TIME     Value
442      KOR    BEEF  1991  5.085481
443      KOR    BEEF  1992  5.685434

In [99]:
df_sub = pd.pivot(data = df_sub, index = ['LOCATION', 'TIME'], columns = 'SUBJECT', values = 'Value').reset_index()
df_sub.head(2)

SUBJECT LOCATION  TIME      BEEF       PIG   POULTRY     SHEEP
0            KOR  1990       NaN       NaN  5.570102  0.204153
1            KOR  1991  5.085481  9.930182  6.738203  0.157341

In [102]:
df_sub = df_sub.dropna()
df_sub.head(2)

SUBJECT LOCATION  TIME      BEEF        PIG   POULTRY     SHEEP
1            KOR  1991  5.085481   9.930182  6.738203  0.157341
2            KOR  1992  5.685434  13.366378  7.550072  0.299884

In [113]:
from statsmodels.formula.api import ols

In [115]:
model = ols(formula = 'BEEF ~ TIME', data = df_sub).fit()
model.rsquared

0.8354558055303118

In [116]:
model = ols(formula = 'PIG ~ TIME', data = df_sub).fit()
model.rsquared

0.9406814424683883

In [117]:
model = ols(formula = 'POULTRY ~ TIME', data = df_sub).fit()
model.rsquared

0.9476360821526822

In [118]:
model = ols(formula = 'SHEEP ~ TIME', data = df_sub).fit()
model.rsquared

0.0010159280176158525

In [119]:
model = ols(formula = 'timr ~ TIME', data = df_sub).fit()
model.rsquared

0.9476360821526822

In [121]:
df_sub['pred'] = model.predict(df_sub)
df_sub.head()

SUBJECT LOCATION  TIME      BEEF        PIG   POULTRY     SHEEP      pred
1            KOR  1991  5.085481   9.930182  6.738203  0.157341  6.700131
2            KOR  1992  5.685434  13.366378  7.550072  0.299884  7.050465
3            KOR  1993  5.325765  13.498602  7.874409  0.239479  7.400799
4            KOR  1994  5.698819  13.984315  7.918354  0.275853  7.751134
5            KOR  1995  6.568429  14.585806  8.631892  0.255908  8.101468

In [126]:
from sklearn.metrics import mean_absolute_percentage_error

In [127]:
mean_absolute_percentage_error(df_sub["POULTRY"], df_sub['pred'])

0.0548818258819814

In [128]:
 # (MAPE =  ( | y - y  | / y ) * 100/n ))
sum(abs(df_sub['POULTRY'] - df_sub['pred']) / df_sub['POULTRY']) * 100 / len(df_sub)

5.48818258819814